In [1]:
from pandas import Series,DataFrame
import pandas as pd

In [2]:
import numpy as np

In [2]:
df1=DataFrame({'key':['b','b','a','c','a','a','b'],'data1':range(7)})

In [3]:
df2=DataFrame({'key':['a','b','d'],'data2':range(3)})

In [4]:
pd.merge(df1,df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [5]:
df3=DataFrame({'lkey':['b','b','a','c','a','a','b'],'data1':range(7)})

In [6]:
df4=DataFrame({'rkey':['a','b','d'],'data2':range(3)})

In [7]:
pd.merge(df3,df4,left_on='lkey',right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [8]:
pd.merge(df1,df2, how='outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

In [9]:
df1=DataFrame({'key':['b','b','a','c','a','b'],'data1':range(6)})
df2=DataFrame({'key':['a','b','a','b','d'],'data2':range(5)})

In [10]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [11]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [12]:
pd.merge(df1, df2, on='key', how='left')

   key  data1  data2
0    b      0    1.0
1    b      0    3.0
2    b      1    1.0
3    b      1    3.0
4    a      2    0.0
5    a      2    2.0
6    c      3    NaN
7    a      4    0.0
8    a      4    2.0
9    b      5    1.0
10   b      5    3.0

In [13]:
pd.merge(df1,df2,how='inner')

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   b      5      1
5   b      5      3
6   a      2      0
7   a      2      2
8   a      4      0
9   a      4      2

In [14]:
left=DataFrame({'key1':['foo','foo','bar'],'key2':['one','two','one'],'lval':[1,2,3]})

In [15]:
left

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [16]:
right=DataFrame({'key1':['foo','foo','bar','bar'],'key2':['one','one','one','two'],'rval':[4,5,6,7]})

In [17]:
right

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [19]:
pd.merge(left,right,on=['key1','key2'], how='outer')

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

In [20]:
pd.merge(left, right, on='key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [21]:
pd.merge(left,right,on='key1',suffixes=('_left','_right'))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

In [22]:
left1=DataFrame({'key':['a','b','a','a','b','c'],'value':range(6)})

In [23]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [24]:
right1=DataFrame({'group_val':[3.5,7]},index=['a','b'])

In [25]:
right1

   group_val
a        3.5
b        7.0

In [26]:
pd.merge(left1,right1,left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [29]:
pd.merge(left1,right1,left_on='key',right_index=True,how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [32]:
lefth=DataFrame({'key1':['Ohio','Ohio','Ohio','Nevada','Nevada'],'key2':[2000,2001,2002,2001,2002],'data':np.arange(5.)})

In [31]:
import numpy as np

In [33]:
lefth

     key1  key2  data
0    Ohio  2000   0.0
1    Ohio  2001   1.0
2    Ohio  2002   2.0
3  Nevada  2001   3.0
4  Nevada  2002   4.0

In [34]:
righth=DataFrame(np.arange(12).reshape((6,2)),index=[['Nevada','Nevada','Ohio','Ohio','Ohio','Ohio'],[2001,2000,2000,2000,2001,2002]],columns=['event1','event2'])

In [35]:
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [36]:
pd.merge(lefth,righth,left_on=['key1','key2'],right_index=True)

     key1  key2  data  event1  event2
0    Ohio  2000   0.0       4       5
0    Ohio  2000   0.0       6       7
1    Ohio  2001   1.0       8       9
2    Ohio  2002   2.0      10      11
3  Nevada  2001   3.0       0       1

In [38]:
left2=DataFrame([[1.,2.],[3.,4.],[5,6]],index=['a','c','e'],
    columns=['Ohio','Nevada'])
right2=DataFrame([[7.,8.],[9,10],[11,12],[13,14]],index=['b','c','d','e'],
    columns=['Missouri','Alabama'])

In [39]:
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [40]:
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [41]:
pd.merge(left2,right2,how='outer',left_index=True,right_index=True)

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [42]:
left2.join(right2, how='outer')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [43]:
left1.join(right1, on='key')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [44]:
another=DataFrame([[7.,8.],[9,10],[11,12],[16,17]],index=['a','c','e','f'],columns=['New York','Oregon'])

In [45]:
another

   New York  Oregon
a       7.0     8.0
c       9.0    10.0
e      11.0    12.0
f      16.0    17.0

In [46]:
left2.join([right2,another])

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
c   3.0     4.0       9.0     10.0       9.0    10.0
e   5.0     6.0      13.0     14.0      11.0    12.0

In [47]:
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [48]:
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [50]:
arr=np.arange(12).reshape((3,4))

In [51]:
np.concatenate([arr,arr], axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [52]:
np.concatenate([arr,arr], axis=0)

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [53]:
s1=Series([0,1], index=['a','b'])
s2=Series([2,3,4], index=['c','d','e'])
s3=Series([5,6], index=['f','g'])

In [54]:
pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [55]:
pd.concat([s1,s2,s3], axis=1)

E:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [59]:
s4=pd.concat([s1*5, s3])
s4

a    0
b    5
f    5
g    6
dtype: int64

In [57]:
pd.concat([s1,s4], axis=1)

E:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     0  1
a  0.0  0
b  1.0  5
f  NaN  5
g  NaN  6

In [58]:
pd.concat([s1,s4], axis=1, join='inner')

   0  1
a  0  0
b  1  5

In [60]:
pd.concat([s1,s4], axis=1, join_axes=[['a','c','b','e']])

     0    1
a  0.0  0.0
c  NaN  NaN
b  1.0  5.0
e  NaN  NaN

In [62]:
pd.concat([s1,s1,s3],keys=['one','two','three'])

one    a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
dtype: int64

In [63]:
pd.concat([s1,s2,s3], axis=1, keys=['one','two','three'])

E:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

In [64]:
df1=DataFrame(np.arange(6).reshape(3,2),index=['a','b','c'],columns=['one','two'])
df2=DataFrame(5+np.arange(4).reshape(2,2),index=['a','c'],columns=['three','four'])

In [65]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [66]:
df2

   three  four
a      5     6
c      7     8

In [67]:
pd.concat([df1,df2], axis=1, keys=['level1', 'level2'])

E:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [69]:
a=Series([np.nan,2.5,np.nan,3.5,4.5,np.nan],index=['f','e','d','c','b','a'])
b=Series(np.arange(len(a),dtype=np.float64),index=['f','e','d','c','b','a'])

In [70]:
b[-1]=np.nan

In [71]:
np.where(pd.isnull(a),b,a)

array([0. , 2.5, 2. , 3.5, 4.5, nan])

In [72]:
b[:-2].combine_first(a[2:])

a    NaN
b    4.5
c    3.0
d    2.0
e    1.0
f    0.0
dtype: float64

In [73]:
df1=DataFrame({'a':[1.,np.nan,5,np.nan],'b':[np.nan,2.,np.nan,6.],'c':range(2,18,4)})
df2=DataFrame({'a':[5.,4.,np.nan,3,7],'b':[np.nan,3,4,6,8]})

In [74]:
df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [75]:
df2

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [76]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

In [80]:
data=DataFrame(np.arange(6).reshape((2,3)),index=pd.Index(['Ohio','Colorado'],name='state'),
    columns=pd.Index(['one','two','three'], name='number'))
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [82]:
result=data.unstack()

In [83]:
result

number  state
one     Ohio        0
        Colorado    3
two     Ohio        1
        Colorado    4
three   Ohio        2
        Colorado    5
dtype: int32

In [81]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [86]:
data=DataFrame({'k1':['one']*3+['two']*4,'k2':[1,1,2,3,3,4,4]})

In [87]:
data

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [88]:
data.duplicated()

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [89]:
data.drop_duplicates()

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [125]:
data=DataFrame({'k1':['one']*3+['two']*4,'k2':[1,1,2,3,3,4,4]})
data['v11']=range(7)

In [95]:
data

    k1  k2  v11
0  one   1    0
1  one   1    1
2  one   2    2
3  two   3    3
4  two   3    4
5  two   4    5
6  two   4    6

In [143]:
data.ix[0:2,1:3]

E:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

   k2  v11
0   1    0
1   1    1
2   2    2

In [17]:
data=DataFrame({'food':['bacon','pulled pork','bacon','Postrami','corned beef','Bacon','postrami','honey ham','nova lox'],'ounces':[4,3,12,6,7.5,8,3,5,6]})

In [4]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Postrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [15]:
meat_to_animal={'bacon':'pig','pulled pork':'pig','postrami':'cow','corned beef':'cow','honey ham':'pig','nova lox':'salmon'}

In [6]:
meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [7]:
data['animal']=data['food'].map(str.lower).map(meat_to_animal)

In [8]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Postrami     6.0     NaN
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [18]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [19]:
data=Series([1.,-999,2.,-999,-1000,3])

In [20]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [21]:
data.replace([-999,-1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [22]:
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [23]:
data=DataFrame(np.arange(12).reshape((3,4)),
    index=['Ohio','Colorado','New York'],
    columns=['one','two','three','four'])

In [24]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [25]:
data.index.map(str.upper)

Index(['OHIO', 'COLORADO', 'NEW YORK'], dtype='object')

In [26]:
data.rename(index=str.title, columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [27]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [28]:
ages=[20,22,25,27,21,23,37,31,61,45,41,32]

In [29]:
bins=[18,25,35,60,100]

In [30]:
cats=pd.cut(ages, bins)

In [32]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [33]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [34]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [35]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [36]:
data=np.random.randn(1000)

In [37]:
cats=pd.qcut(data,4)

In [38]:
pd.value_counts(cats)

(0.646, 3.055]      250
(0.0152, 0.646]     250
(-0.657, 0.0152]    250
(-2.779, -0.657]    250
dtype: int64

In [39]:
cats

[(-0.657, 0.0152], (-0.657, 0.0152], (-2.779, -0.657], (-2.779, -0.657], (0.646, 3.055], ..., (0.0152, 0.646], (0.0152, 0.646], (0.0152, 0.646], (-2.779, -0.657], (0.0152, 0.646]]
Length: 1000
Categories (4, interval[float64]): [(-2.779, -0.657] < (-0.657, 0.0152] < (0.0152, 0.646] < (0.646, 3.055]]

In [43]:
a=pd.qcut(data, [0,0.1,0.5,0.9,1.])

In [44]:
a

[(-1.157, 0.0152], (-1.157, 0.0152], (-2.779, -1.157], (-2.779, -1.157], (1.229, 3.055], ..., (0.0152, 1.229], (0.0152, 1.229], (0.0152, 1.229], (-2.779, -1.157], (0.0152, 1.229]]
Length: 1000
Categories (4, interval[float64]): [(-2.779, -1.157] < (-1.157, 0.0152] < (0.0152, 1.229] < (1.229, 3.055]]

In [45]:
pd.value_counts(a)

(0.0152, 1.229]     400
(-1.157, 0.0152]    400
(1.229, 3.055]      100
(-2.779, -1.157]    100
dtype: int64

In [46]:
b=pd.cut(data, [0,0.1,0.5,0.9,1.])

In [47]:
pd.value_counts(b)

(0.1, 0.5]    160
(0.5, 0.9]    128
(0.0, 0.1]     40
(0.9, 1.0]     31
dtype: int64

In [48]:
data

array([-1.10809308e-01, -2.16110408e-01, -1.71030541e+00, -1.62335457e+00,
        1.32585988e+00,  1.04641246e+00, -1.79117544e+00, -9.88048771e-01,
       -1.17580561e+00, -3.09306760e-01,  5.91857497e-01,  1.69267551e-01,
        2.98295554e-01,  3.37026187e-01, -4.31797868e-01, -5.52682807e-01,
       -2.09281883e-02, -5.22700753e-01, -1.00622974e+00,  1.34864987e+00,
        9.04439262e-01, -3.24913407e-01,  4.95770337e-01, -6.13380790e-01,
       -9.30482093e-01, -1.14591499e+00,  3.08540309e-01, -4.04796999e-01,
        1.21204854e+00,  1.71521934e+00,  6.84154569e-01,  5.69497504e-01,
        6.87954522e-01, -2.40724300e-01,  1.76855954e-01, -1.04482981e+00,
       -4.42094605e-01,  6.19895600e-01, -1.00140212e+00, -6.25727663e-01,
       -5.64119455e-01,  6.60500765e-01,  6.46040227e-01,  7.72646650e-01,
        7.39870493e-02, -9.97580929e-01,  4.22224739e-01, -7.89544776e-03,
       -1.52597187e+00, -4.93666192e-01, -7.20738665e-01, -8.19063522e-01,
        1.19784672e+00,  1.72703541e-01,  2.40569728e-01,  1.27458221e+00,
        2.58418824e-01, -1.27909992e+00, -1.96758163e+00,  4.13724484e-01,
        5.46360193e-02, -6.86702199e-01, -1.25146257e+00,  4.12539453e-01,
       -2.14731276e-01, -1.10490300e+00,  3.80098606e-01, -9.73721695e-01,
        1.80661191e-01, -2.10598782e+00, -5.17254251e-01, -6.85614902e-01,
       -2.88497305e-01,  3.26281033e-01,  1.26568761e+00, -1.04447326e-02,
        6.59795168e-01, -2.09924176e+00,  7.66958293e-01, -7.18869593e-02,
       -1.14791262e+00,  8.15147956e-01, -7.12284157e-01, -1.27704876e+00,
        3.03985625e+00,  1.18338021e+00, -5.45730508e-01, -1.10634330e+00,
        4.05411352e-01,  7.07051627e-01,  9.86499776e-01, -4.69638376e-01,
        1.76941901e+00, -6.88512170e-01, -5.80033950e-01,  3.67425526e-01,
        2.18937452e+00,  4.10630844e-01, -1.05655343e+00, -3.04663714e-01,
        1.56645144e+00, -5.08530289e-01, -2.49178704e-01, -8.13796114e-01,
       -7.69592910e-01,  4.94675956e-01,  8.15289072e-01,  1.86752202e+00,
       -1.56088634e-01, -7.80056282e-01,  3.86840569e-01, -5.01238967e-01,
        4.31525966e-01,  3.35030015e-01,  9.75796321e-01, -6.54227235e-01,
       -2.33277970e-01, -1.45573205e-01, -6.49185191e-01, -7.92112659e-01,
       -1.97285599e-02, -2.34892827e-01,  1.72775620e+00, -1.02158000e+00,
        2.68704289e+00, -3.40244000e-01, -5.81249695e-01,  2.52281244e+00,
        3.48228044e-01, -8.49648054e-01, -1.41610343e+00, -1.50997746e+00,
       -7.47165841e-03, -4.61440800e-02, -3.57951187e-01,  7.75764752e-01,
        1.46389607e-01, -5.05306445e-01, -6.92767788e-01, -6.58938203e-01,
        7.58788916e-01, -2.84663470e-01,  1.55974901e-01, -6.40863082e-01,
        1.66267907e+00, -1.49010861e+00,  1.08056140e+00, -7.69740274e-01,
        1.47759986e+00,  6.13085370e-01, -5.91728111e-01, -1.56180587e-01,
       -8.21570010e-01, -1.07789827e+00,  3.76360299e-01,  7.81752676e-01,
       -8.41439874e-01, -1.38613800e+00,  3.72246188e-01, -3.71475175e-01,
        1.39337569e+00, -6.38212064e-01, -7.31458707e-01,  3.94097348e-02,
       -6.85983903e-01, -1.71966858e-01,  1.71000679e+00, -1.07674334e+00,
        3.40893631e-01, -5.85451499e-01,  1.70366150e+00,  9.39835287e-02,
       -2.65154689e+00, -2.59187721e-01,  4.73960661e-01, -1.31410545e+00,
        1.31216299e+00,  4.66414945e-01,  7.93813609e-01,  1.82473545e+00,
       -1.39119608e+00, -7.22421326e-01, -4.51128486e-01,  1.07554333e+00,
       -1.64079709e+00, -1.19980361e+00, -1.05762679e+00, -1.02121782e-01,
        3.30888771e-01,  1.53617145e+00,  7.38190626e-01, -6.49181278e-01,
        1.85887994e+00,  2.30704139e+00,  9.45515111e-01,  2.88316711e-02,
       -2.25560789e-01,  7.16810619e-01,  1.08347919e-01,  6.62961604e-01,
        4.88547640e-01,  9.54659102e-01,  2.44643768e-02, -5.04231550e-01,
       -5.17822848e-01,  2.95495256e+00, -6.12150629e-01,  1.21112834e+00,
       -1.52445425e+00,  7.71810334e-02,  4.06560889e-02, -4.77312019e-01,
        6.42426143e-01, -6.65142805e-01, -1.07816615e+00, -1.07235576e+00,
        1.43160338e+00, -1.03116746e+00,  4.27708858e-01, -1.25154016e+00,
       -1.75414258e-01, -3.45150856e-01,  1.24828890e+00, -1.48086891e+00,
       -2.51675606e-01,  3.81791613e-02, -7.39684030e-01,  1.88889571e-01,
       -2.39886151e-01, -5.11888358e-01,  3.33345310e-01, -5.14794893e-01,
        1.04047152e+00,  1.20818173e+00,  1.41675418e+00,  1.11568019e+00,
       -2.58587661e-01,  3.32642800e-01, -1.18749180e+00,  3.59454390e-01,
       -1.27404869e+00,  1.64261941e+00,  1.24448497e+00, -6.20666274e-02,
        1.78288294e+00,  8.01528477e-01, -6.17053997e-01,  1.47831975e+00,
       -3.56129840e-01, -6.09071935e-01, -8.28563308e-01,  4.27606039e-01,
       -6.55791051e-01, -5.37472855e-01, -8.20200287e-01,  2.03901972e-01,
       -1.85918781e-01, -1.42919490e+00, -6.13209037e-01,  9.03029227e-01,
       -4.48727208e-01, -4.00050456e-01,  3.92844037e-01, -2.18587396e-01,
       -2.37421411e-01,  6.86806727e-01,  4.94432236e-01,  8.60717662e-01,
        7.74029305e-02, -1.59147491e+00, -1.50247605e+00,  4.63681931e-01,
       -4.35938822e-01,  2.16322083e+00,  1.76538457e+00,  5.62258243e-02,
       -1.08631939e+00, -5.60440244e-01, -3.47311424e-02,  3.03153705e-01,
       -2.46192503e-01, -6.07601708e-01, -8.03080545e-01,  6.95069063e-01,
       -1.15570580e+00,  7.72688922e-02, -9.98062564e-01,  2.65203248e-01,
       -2.04627046e+00,  3.58988760e-01, -1.29582041e-01, -1.37063649e+00,
       -7.23581091e-02, -2.93933098e-01,  4.64436473e-01, -7.49511869e-01,
       -8.04914760e-01,  5.67753149e-02, -1.08396379e+00,  9.50804541e-01,
       -6.38200567e-01, -6.65876452e-01,  1.86925852e-01, -1.97532099e+00,
       -1.85483524e+00, -1.24109463e+00, -5.13892453e-01, -1.27390023e+00,
        3.08119812e-01,  4.58276574e-01, -1.20113955e+00, -1.43446925e+00,
        1.07951737e+00, -2.26896475e+00,  2.51435547e-01, -4.99044143e-01,
        1.53125159e+00,  1.87863806e-01, -4.70562667e-01, -1.17658102e+00,
       -3.40004695e-01, -1.08854879e+00,  9.68649868e-01,  8.76280988e-01,
       -1.57804654e+00, -6.12266036e-01,  3.50264000e-01,  4.87111044e-01,
        1.14752214e+00, -1.99535838e+00,  9.80971842e-01, -2.03456201e-01,
        2.26194570e+00,  6.80751534e-01, -1.13167054e+00, -9.40715659e-01,
       -2.99668765e-01,  2.81851042e-01, -1.36232134e+00,  8.29102157e-01,
       -1.22479114e+00,  8.13873952e-01, -4.87607537e-01,  1.15610440e+00,
        2.29167494e-01,  1.30795138e+00,  1.77514020e+00, -1.79283906e-01,
       -4.66516409e-02,  4.79542442e-01, -7.29724382e-01, -4.94793090e-02,
       -6.36333450e-01,  1.73068796e-01,  9.39257616e-01, -2.28844793e-01,
        5.40630263e-02, -1.16255596e+00,  2.92308675e-01,  2.13098211e-01,
        6.62495897e-01,  1.91212434e-01,  1.99557163e+00, -2.46261287e+00,
        1.85042205e+00, -8.72951194e-01,  8.81972247e-01,  6.58263192e-01,
        2.12196554e+00,  6.66910803e-01, -9.23935018e-01, -8.55616480e-01,
       -1.44156355e+00,  7.54175532e-01, -9.75617064e-01, -1.54717914e-01,
        6.52646689e-01, -7.94588985e-01, -9.77807915e-02,  6.03478040e-01,
        6.34797993e-01,  6.69033643e-01, -7.64128048e-01,  1.32145711e+00,
        5.03498792e-01, -1.09070146e+00, -2.25992895e-01,  2.48773509e-01,
       -2.42701938e+00, -4.83052783e-01, -1.67419472e+00,  4.52199104e-02,
       -3.60614131e-01, -1.83811191e-01, -3.76679368e-01, -2.57413326e-01,
        9.57047541e-01, -3.73515142e-01, -7.20205414e-02,  2.74531304e-01,
        8.03755712e-01,  2.08618385e+00, -1.44753116e-01, -5.67482916e-01,
        3.00672586e-01, -1.06758960e+00, -8.59895726e-01,  9.05258333e-01,
        7.79581106e-01,  8.51934153e-01,  1.00001937e+00, -7.02811098e-02,
       -6.50703834e-01, -3.55463951e-01, -6.47614817e-02, -9.19989126e-01,
       -7.31194765e-03, -1.58731756e-01, -2.09377282e+00,  5.42146008e-01,
        1.32631286e-01, -5.35905926e-01, -1.23484890e+00,  1.17569402e+00,
        1.49425179e+00,  1.10230372e+00,  6.83887200e-01, -3.45659962e-01,
        1.42074482e+00,  1.38438647e+00, -2.24721952e-01,  4.00935318e-01,
       -1.14577941e+00, -1.49971888e+00, -9.30908260e-01,  3.91329486e-02,
        8.27220753e-01, -8.64502311e-01,  1.17597742e+00,  9.14110919e-01,
        2.82957572e+00,  2.25208747e+00,  6.56638690e-01,  1.28059264e-01,
        1.25173601e+00, -6.55969963e-01, -3.64905739e-01,  2.17878716e+00,
       -6.91506518e-01,  2.41835891e-01, -1.89658021e+00, -1.13535579e-01,
       -7.26616958e-01,  2.36817883e-01, -2.82076951e-01,  4.00348419e-01,
        4.76067633e-01,  2.21494431e-01,  6.36755171e-01, -1.30643995e+00,
        1.41245172e+00,  1.84444802e-01, -2.22915934e+00,  4.77506525e-01,
       -1.11249997e+00,  1.08344872e+00,  4.80745800e-01, -6.82872434e-01,
        1.71339792e-01, -3.52239648e-01,  7.76850902e-02,  1.62362356e+00,
       -1.56154432e+00,  1.40144468e+00, -1.78384902e+00,  6.10184307e-01,
        1.39753747e-01,  9.97911791e-01,  4.95794821e-01,  8.63934032e-01,
       -2.56604534e-01,  3.05484176e+00, -1.41428448e+00,  3.36708579e-01,
       -2.69330377e-01,  4.60980494e-01,  2.09331284e-01, -1.37901075e-01,
       -1.07136283e+00, -3.44596708e-01,  6.33019810e-01, -1.29942095e+00,
        4.07291657e-02,  5.95972039e-01, -2.57844517e-01, -6.58033749e-01,
        4.86392614e-01, -4.74186328e-01, -8.73782922e-01,  5.64305615e-01,
       -1.05094404e+00, -7.79216547e-01,  9.97560172e-01, -9.76122723e-01,
       -6.67450566e-01, -5.64431686e-01, -1.25124694e+00,  1.41291408e-01,
       -7.59211096e-01,  5.61485329e-01, -1.01959190e+00,  4.84483249e-02,
       -2.77635302e+00, -2.19620267e-01, -1.95112710e-01, -1.18764820e+00,
       -7.68035638e-01, -9.08497297e-01,  1.02650608e+00, -1.97058944e-01,
        7.14720033e-01,  9.68300134e-01,  6.22850312e-01,  7.16565016e-01,
        1.08302925e+00, -1.06073758e-01, -1.63430012e-01, -7.11147847e-01,
        9.99531219e-02, -7.39831745e-01,  2.15701986e-01, -1.14038127e+00,
        2.14005275e+00, -8.59632361e-02,  1.39999719e+00, -9.61129336e-01,
       -4.41670471e-01,  1.58452816e+00, -2.95448796e-01,  1.77193728e-01,
       -1.60627901e+00,  6.28498781e-01,  1.17091746e+00, -7.27232598e-01,
       -1.25645935e+00, -4.92257449e-01, -6.48717399e-01,  8.39799678e-01,
        5.33447278e-01,  3.96008535e-01, -6.56767819e-01, -4.84120059e-01,
        1.47640916e+00,  8.79173322e-01, -1.61697416e-01, -8.40707021e-01,
        2.82914495e-01, -6.94606638e-01, -2.43581269e-01,  5.55207600e-01,
        1.47072430e-01,  3.26210119e-01, -6.69068918e-01, -8.50217801e-02,
        9.81151533e-01,  1.76097107e+00,  5.57714507e-01,  1.03455853e+00,
       -7.24033301e-01,  6.14532911e-02,  2.68801396e-01, -7.78372493e-01,
       -2.02949309e-01, -6.68230646e-01,  2.63798939e-01,  6.66994675e-01,
       -6.64564201e-01, -8.17535410e-01,  8.34607795e-01,  1.48429426e+00,
       -9.14933981e-01,  1.00177244e+00, -7.39617042e-01, -8.19598297e-02,
       -8.66284864e-01, -1.37882723e+00,  3.28285550e-01,  1.34837949e+00,
        2.22319095e-01,  1.40515946e+00,  4.18884142e-01, -2.40418252e+00,
       -5.24999824e-01, -1.86991099e+00, -1.50712244e-01, -4.43744962e-01,
        2.17931217e-01,  2.58889744e+00, -1.02202919e+00, -1.70185368e+00,
        1.86997032e-01,  8.90023417e-01, -1.37307471e+00, -6.82738667e-01,
        4.95530660e-01,  6.21580205e-02, -2.62517687e-01, -3.46245732e-01,
        5.33355035e-01,  8.93207786e-01,  2.19002603e-02, -5.18227594e-01,
        1.52260807e+00,  9.28010922e-01,  1.77649105e+00,  2.65716445e+00,
        1.37370580e+00, -2.27189677e-01,  3.00722524e-01, -9.70454447e-01,
        5.97061086e-01, -9.64089238e-01, -8.87834477e-01,  5.18726261e-01,
        9.76940834e-01,  1.04319643e+00,  5.93654984e-01, -1.57087210e-03,
        2.10455177e+00,  1.90339283e-01, -5.18826505e-01, -2.45437117e-01,
        5.84931853e-01, -2.62144043e-01, -8.43365919e-01,  1.26884067e+00,
       -2.72384933e-01,  5.70308334e-02, -1.13898631e-01, -4.91971576e-01,
        4.34681001e-01,  9.26520093e-01,  6.51886562e-01,  1.09815254e+00,
       -7.69491648e-01,  7.49224707e-01,  1.09174940e+00,  6.91619382e-01,
       -2.89561884e-01,  9.94485250e-02, -9.43848258e-01, -2.84451077e-01,
       -3.19138675e-01, -8.77555932e-01,  3.87352065e-01,  1.22764854e+00,
       -6.19391220e-01,  1.26759655e+00,  6.98441497e-01, -1.52897877e+00,
       -9.29556609e-02,  7.96608836e-01, -6.46970455e-01,  5.06729400e-01,
       -9.50542992e-02,  2.11555688e+00, -3.13927138e-01,  1.07113122e+00,
        5.92766719e-01,  4.11736732e-02,  6.94345651e-01, -1.53298367e+00,
        6.36633799e-01, -2.03098678e+00, -6.04969139e-01,  1.68786557e+00,
       -9.84604660e-02, -5.72287748e-01,  3.60390070e-01,  1.77962275e-01,
       -1.11983494e+00,  5.79005126e-01,  2.90956604e-01, -1.30586013e+00,
        8.03935559e-01,  5.92847607e-01, -7.30069810e-01,  1.39433514e-01,
       -1.45658028e+00, -1.47466017e+00,  1.42530838e+00, -3.96208963e-01,
        3.74054668e-01,  2.50962533e+00,  6.00698681e-01,  3.36943004e-01,
        1.05813581e+00, -6.75378983e-02, -2.24856434e+00, -7.12164038e-02,
        1.03579628e+00,  6.42449695e-01, -2.01215761e+00,  4.31742468e-01,
       -1.06375484e+00, -3.19981424e-02, -1.33637894e+00,  1.98330063e+00,
       -7.91883296e-01,  9.64010550e-01, -2.77827581e+00,  4.93314445e-01,
       -5.79762953e-01, -1.35220831e+00, -3.03020728e-01,  8.62689714e-01,
       -3.55321535e-01,  3.46410471e-02,  3.39471033e-01, -2.50615099e+00,
        1.87370969e+00, -2.86414484e-01,  1.64420682e+00, -3.05479731e-03,
        3.17038925e-01, -1.86735551e+00, -3.19353763e-01,  1.45234517e-01,
       -7.80536844e-01, -9.33699364e-01,  9.01464268e-01, -6.41959469e-01,
        2.77023255e-01,  8.53699441e-01, -8.02721022e-01, -3.19789638e-01,
       -1.49043706e+00,  3.45636203e-01, -4.63123843e-01,  2.43099645e+00,
        1.06640076e+00, -8.32471591e-01, -4.48226444e-01,  5.41114754e-01,
       -1.59179470e+00, -8.15809919e-01,  7.34224546e-01,  5.05392039e-02,
        5.57061307e-01,  1.11775094e+00, -4.02247731e-01, -5.76535377e-01,
       -1.72544537e+00, -7.55585431e-01, -1.15717345e+00, -7.63956804e-01,
        5.51882314e-01, -5.14095107e-02, -1.11198022e+00,  3.12137701e-01,
        3.06797412e-01,  1.08079720e+00, -1.44974616e+00, -1.25163525e+00,
        1.33064375e-01, -2.65790883e-01,  4.67046780e-01,  2.62317530e-01,
        7.57007414e-01,  7.52919497e-01, -4.47078482e-01,  6.91539358e-01,
        2.79329139e-01,  5.08909347e-01,  1.89323526e-02,  8.39004715e-01,
        9.08538686e-01,  6.04393054e-01, -2.59042091e+00,  1.09789167e+00,
        1.09584791e+00, -8.65056073e-01,  5.62038166e-03,  5.37457958e-01,
       -2.37521499e-01, -5.86637141e-01,  6.46169123e-01,  1.00936859e-01,
       -5.78581680e-01,  1.02811468e+00,  1.57744583e-01, -5.40770038e-01,
       -1.95018787e+00,  1.40808031e-02,  5.14361141e-01,  7.42243254e-01,
        1.17167712e+00, -1.41060199e+00,  9.61093442e-01,  2.67174602e-01,
        6.11799059e-01,  1.42948808e+00,  1.04267114e+00,  1.77032533e+00,
        1.86825511e-01, -4.13107263e-01, -9.06791902e-01,  1.15248875e+00,
        1.43448239e-01, -3.67205844e-01,  2.95482165e-01,  1.27807095e+00,
        2.65147650e-01, -2.98458658e-01, -3.56567807e-02,  9.98054998e-01,
       -1.48496785e+00, -7.46597676e-01,  7.47163053e-01,  8.83752487e-01,
        2.64212208e+00,  2.53047778e-01, -2.22464945e+00, -5.93865948e-01,
       -1.14483021e+00, -6.75488523e-01,  1.02174055e+00,  6.03574503e-01,
       -6.13086587e-01,  1.02240715e+00, -6.81643826e-01, -6.92843230e-01,
       -5.69814597e-01,  2.08679847e-01, -9.41348904e-01, -1.24678128e+00,
       -8.28527445e-01, -1.57703749e-01,  3.97094263e-01,  1.90225575e+00,
       -2.73299011e-01,  2.76067150e-01, -6.37730867e-01, -5.80633584e-02,
       -3.22552101e-01,  5.74577195e-01,  1.66391052e+00, -2.04861222e-01,
       -4.91832612e-01, -1.28508566e+00, -3.11799919e-01, -6.63218515e-02,
        1.44118309e+00,  1.65517116e+00, -9.98170226e-01, -8.61470960e-01,
       -8.98442502e-01, -6.85055466e-01, -2.83708595e-01, -8.08770456e-01,
        1.16220170e+00,  2.10223224e-01,  1.66994023e+00,  1.79502924e-01,
       -2.36648050e-02, -1.28415686e-01,  4.51716623e-01, -4.78920829e-02,
        1.20295646e+00, -8.35309508e-01, -7.90970161e-01,  6.04513048e-01,
        2.37362528e+00,  8.14514501e-01, -3.60286204e-01,  7.94078708e-02,
        3.26040785e-01, -1.15662544e+00, -8.45826836e-01,  2.03477808e-01,
        2.95873023e-03,  6.20541916e-01,  9.83817644e-01,  9.32341687e-01,
       -4.00616913e-01,  1.75705089e+00,  3.13619481e-01,  1.22680144e-01,
        1.95792238e+00, -1.70503572e-01,  3.32775989e-01,  6.63394421e-01,
        1.59578061e-01, -1.02804773e+00,  8.50082057e-02,  1.23990252e-01,
        3.64869261e-01, -2.11047023e+00,  1.97422279e+00, -5.32746471e-01,
        9.50641027e-01,  6.46160413e-01,  5.39826279e-01,  6.21972987e-01,
       -9.41713009e-01, -4.16032633e-01, -7.39045961e-01,  6.38089368e-01,
        1.93351236e+00, -1.08029430e+00,  9.78985589e-01,  4.21786432e-01,
       -4.65605924e-01,  5.71015944e-01,  1.38592656e+00,  2.99782028e-01,
        1.18705943e+00, -6.50313174e-01,  1.64963714e+00, -4.40926434e-02,
        5.33115511e-01, -9.82230390e-01,  8.52852637e-01, -9.57477857e-01,
       -1.78194005e-01,  9.80583567e-01,  8.66745238e-02, -8.43841746e-01,
       -5.34754659e-01,  2.50272925e-01, -5.05250922e-01,  1.24119314e+00,
        7.77119970e-01,  8.82070131e-01,  5.35961741e-01,  1.53204841e-02,
        2.39113983e+00, -1.68143955e-01, -3.05443387e-01, -1.50020300e-01,
       -4.94705193e-01, -6.91231001e-01,  2.48598272e-01, -9.65956594e-01,
       -1.46720023e+00,  1.45456598e+00,  3.03662502e-01,  1.14511840e+00,
        4.80996363e-01,  9.61634729e-02,  9.88248723e-01,  8.88325718e-01,
        1.17298024e-01,  6.69637703e-01,  1.51241067e-02, -1.81615336e+00,
        8.65378173e-02, -1.92854798e+00,  1.13512291e-01, -5.54694703e-01,
       -2.21033245e-01,  6.32744107e-02,  5.60937290e-01, -2.30414458e-01,
        1.80708261e+00, -1.70683790e+00, -1.79306144e-01, -1.42015216e-01,
        6.01729843e-01, -7.76846013e-01, -4.38596629e-01, -7.19351856e-02,
        4.76458230e-01, -3.37825756e-01,  1.86704424e+00, -8.17699617e-01,
       -1.03043368e+00,  4.87174338e-01,  2.25332461e-01,  4.16905309e-01,
       -1.69559468e-02,  4.49962560e-01, -1.08873535e+00, -6.53587583e-01,
       -1.60836822e+00,  2.41270719e+00,  1.50837016e-01, -3.63138179e-01,
        1.57015061e-01, -6.40796317e-04, -2.41980346e-01, -2.61707792e-01,
        8.00316912e-01,  7.39302603e-01,  1.64418158e+00,  4.61312674e-01,
        1.63538384e-01,  5.59394638e-01, -1.83306699e+00,  1.87392425e-01])

In [49]:
data=DataFrame(np.random.randn(1000,4))

In [50]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.027496     0.017979     0.000275     0.103226
std       1.018396     1.008159     1.005540     1.003964
min      -3.559935    -3.613694    -3.286232    -2.802449
25%      -0.648998    -0.687427    -0.685015    -0.578914
50%       0.034195     0.051860     0.024792     0.067054
75%       0.705338     0.708537     0.655034     0.753923
max       2.863578     3.177617     3.009105     3.284547

In [51]:
col=data[3]

In [70]:
col[np.abs(col)>3]

708    3.284547
Name: 3, dtype: float64

In [73]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
40  -3.559935 -0.809021 -0.686234  0.469979
66  -3.027247 -0.848527 -1.032141  1.651718
125 -0.080617  3.177617  1.276651  2.822571
137  0.160036  0.416929  3.009105 -0.084781
316 -1.446967  0.256743 -3.286232 -0.431307
445  1.921084 -3.515979 -0.229831  1.747889
571 -0.155672 -3.613694 -0.492143 -1.036189
708  0.054562 -1.158435  1.198765  3.284547
766 -3.154575 -0.253274 -1.568163  1.194432
980 -3.187423  0.448261  0.591824 -0.032628

In [63]:
df=DataFrame(np.arange(5*4).reshape(5,4))
sampler=np.random.permutation(5)

In [64]:
sampler

array([2, 1, 0, 3, 4])

In [65]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [89]:
df.take(sampler).iloc[2]

0    0
1    1
2    2
3    3
Name: 0, dtype: int32

In [90]:
df.take(sampler)

    0   1   2   3
2   8   9  10  11
1   4   5   6   7
0   0   1   2   3
3  12  13  14  15
4  16  17  18  19

In [85]:
df.iloc[2]

0     8
1     9
2    10
3    11
Name: 2, dtype: int32

In [86]:
df.loc[2]

0     8
1     9
2    10
3    11
Name: 2, dtype: int32

In [87]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [91]:
bag=np.array([5,7,-1,6,4])

In [92]:
sampler=np.random.randint(0,len(bag),size=10)

In [93]:
sampler

array([4, 3, 1, 4, 0, 1, 3, 1, 4, 2])

In [95]:
ser=Series(np.arange(3.))

In [108]:
ser.get_value(1)

E:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: get_value is deprecated and will be removed in a future release. Please use .at[] or .iat[] accessors instead
  """Entry point for launching an IPython kernel.

1.0

In [110]:
ser.iat[1]

1.0

In [106]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [135]:
df.iloc[0:1,0:2]

   0  1
0  0  1

In [137]:
df.loc[0:1,0:2]

   0  1  2
0  0  1  2
1  4  5  6

In [138]:
df.loc[0:1][0:2]

   0  1  2  3
0  0  1  2  3
1  4  5  6  7

In [122]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [113]:
draws=bag.take(sampler)

In [114]:
draws

array([ 4,  6,  7,  4,  5,  7,  6,  7,  4, -1])

In [139]:
bag

array([ 5,  7, -1,  6,  4])

In [140]:
sampler

array([4, 3, 1, 4, 0, 1, 3, 1, 4, 2])

In [141]:
df=DataFrame({'key1':['a','a','b','b','a'], 'key2':['one','two','one','two','one'],'data1':np.random.randn(5),'data2':np.random.randn(5)})

In [142]:
df

  key1 key2     data1     data2
0    a  one  1.003537  0.926073
1    a  two  0.120770  1.797579
2    b  one  0.947621 -0.490029
3    b  two -0.398427  0.388116
4    a  one  0.743518  0.080687

In [143]:
grouped=df['data1'].groupby(df['key1'])

In [145]:
grouped.mean()

key1
a    0.622608
b    0.274597
Name: data1, dtype: float64

In [146]:
mean=df['data1'].groupby([df['key1'], df['key2']]).mean()

In [147]:
mean

key1  key2
a     one     0.873527
      two     0.120770
b     one     0.947621
      two    -0.398427
Name: data1, dtype: float64

In [148]:
mean.unstack()

key2       one       two
key1
a     0.873527  0.120770
b     0.947621 -0.398427

In [149]:
states=np.array(['Ohio','California','California','Ohio','Ohio'])
years=np.array([2005,2005,2006,2005,2006])

In [150]:
states

array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'], dtype='<U10')

In [151]:
df['data1'].groupby([states,years]).mean()

California  2005    0.120770
            2006    0.947621
Ohio        2005    0.302555
            2006    0.743518
Name: data1, dtype: float64

In [152]:
df

  key1 key2     data1     data2
0    a  one  1.003537  0.926073
1    a  two  0.120770  1.797579
2    b  one  0.947621 -0.490029
3    b  two -0.398427  0.388116
4    a  one  0.743518  0.080687

In [153]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.622608  0.934780
b     0.274597 -0.050957

In [154]:
df.groupby(['key1','key2']).mean()

              data1     data2
key1 key2
a    one   0.873527  0.503380
     two   0.120770  1.797579
b    one   0.947621 -0.490029
     two  -0.398427  0.388116

In [155]:
df.groupby(['key1','key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [162]:
for a1,a2 in df.groupby('key2'):
    print (a1)
    print (a2)

one
  key1 key2     data1     data2
0    a  one  1.003537  0.926073
2    b  one  0.947621 -0.490029
4    a  one  0.743518  0.080687
two
  key1 key2     data1     data2
1    a  two  0.120770  1.797579
3    b  two -0.398427  0.388116

In [160]:
df

  key1 key2     data1     data2
0    a  one  1.003537  0.926073
1    a  two  0.120770  1.797579
2    b  one  0.947621 -0.490029
3    b  two -0.398427  0.388116
4    a  one  0.743518  0.080687

In [163]:
for (k1,k2),group in df.groupby(['key1','key2']):
    print (k1,k2)
    print (group)

a one
  key1 key2     data1     data2
0    a  one  1.003537  0.926073
4    a  one  0.743518  0.080687
a two
  key1 key2    data1     data2
1    a  two  0.12077  1.797579
b one
  key1 key2     data1     data2
2    b  one  0.947621 -0.490029
b two
  key1 key2     data1     data2
3    b  two -0.398427  0.388116

In [164]:
pieces=dict(list(df.groupby('key1')))
pieces['b']

  key1 key2     data1     data2
2    b  one  0.947621 -0.490029
3    b  two -0.398427  0.388116

In [165]:
pieces

{'a':   key1 key2     data1     data2
 0    a  one  1.003537  0.926073
 1    a  two  0.120770  1.797579
 4    a  one  0.743518  0.080687, 'b':   key1 key2     data1     data2
 2    b  one  0.947621 -0.490029
 3    b  two -0.398427  0.388116}

In [166]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [167]:
grouped=df.groupby(df.dtypes, axis=1)

In [170]:
list(grouped)

[(dtype('float64'),       data1     data2
  0  1.003537  0.926073
  1  0.120770  1.797579
  2  0.947621 -0.490029
  3 -0.398427  0.388116
  4  0.743518  0.080687), (dtype('O'),   key1 key2
  0    a  one
  1    a  two
  2    b  one
  3    b  two
  4    a  one)]

In [172]:
df.groupby('key1')['data1'].mean()

key1
a    0.622608
b    0.274597
Name: data1, dtype: float64

In [175]:
a=df.groupby(['key1','key2'])[['data2']].mean()

In [176]:
b=df.groupby(['key1','key2'])['data2'].mean()

In [177]:
type(a)

pandas.core.frame.DataFrame

In [178]:
type(b)

pandas.core.series.Series

In [179]:
people=DataFrame(np.random.randn(5,5),columns=['a','b','c','d','e'],index=['Joe','Steve','Wes','Jim','Travis'])

In [182]:
people.ix[2:3,'b':'c']

E:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

            b         c
Wes -0.088725 -0.034665

In [185]:
people.ix[[2,3],['b','c']]

E:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

            b         c
Wes       NaN       NaN
Jim -0.317889 -0.339535

In [181]:
people

               a         b         c         d         e
Joe    -0.449662  1.347727 -0.736147 -1.008046  1.711499
Steve  -1.433323 -1.379453 -0.766969 -0.091294 -1.229605
Wes    -0.067114 -0.088725 -0.034665  0.023262  2.235556
Jim     1.442764 -0.317889 -0.339535  0.908046  0.149733
Travis -0.077131  0.520689  1.741323  0.483508 -0.288359

In [184]:
people.ix[2:3,['b','c']]=np.nan

E:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [198]:
mapping={'a':'red','b':'red','c':'blue','d':'blue','e':'red','j':'orange'}

In [199]:
by_column=people.groupby(mapping, axis=1)

In [188]:
mapping

{'a': 'red', 'b': 'red', 'c': 'blue', 'd': 'blue', 'e': 'red', 'f': 'orange'}

In [200]:
by_column.sum()

            blue       red
Joe    -1.744192  2.609565
Steve  -0.858263 -4.042382
Wes     0.023262  2.168441
Jim     0.568510  1.274608
Travis  2.224831  0.155199

In [192]:
people['f']=[1,2,3,4,5]

In [193]:
people

               a         b         c         d         e  f
Joe    -0.449662  1.347727 -0.736147 -1.008046  1.711499  1
Steve  -1.433323 -1.379453 -0.766969 -0.091294 -1.229605  2
Wes    -0.067114       NaN       NaN  0.023262  2.235556  3
Jim     1.442764 -0.317889 -0.339535  0.908046  0.149733  4
Travis -0.077131  0.520689  1.741323  0.483508 -0.288359  5

In [194]:
by_column=people.groupby(mapping, axis=1)

In [197]:
by_column.sum()

Empty DataFrame
Columns: [a, b, c, d, e, f]
Index: []

In [201]:
map_series=Series(mapping)

In [202]:
map_series

a       red
b       red
c      blue
d      blue
e       red
j    orange
dtype: object

In [203]:
people.groupby(map_series,axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [204]:
people.groupby(len).sum()

          a         b         c         d         e  f
3  0.925988  1.029838 -1.075682 -0.076738  4.096788  8
5 -1.433323 -1.379453 -0.766969 -0.091294 -1.229605  2
6 -0.077131  0.520689  1.741323  0.483508 -0.288359  5

In [205]:
key_list=['one','one','one','two','two']

In [206]:
people.groupby([len,key_list]).min()

              a         b         c         d         e  f
3 one -0.449662  1.347727 -0.736147 -1.008046  1.711499  1
  two  1.442764 -0.317889 -0.339535  0.908046  0.149733  4
5 one -1.433323 -1.379453 -0.766969 -0.091294 -1.229605  2
6 two -0.077131  0.520689  1.741323  0.483508 -0.288359  5

In [207]:
people

               a         b         c         d         e  f
Joe    -0.449662  1.347727 -0.736147 -1.008046  1.711499  1
Steve  -1.433323 -1.379453 -0.766969 -0.091294 -1.229605  2
Wes    -0.067114       NaN       NaN  0.023262  2.235556  3
Jim     1.442764 -0.317889 -0.339535  0.908046  0.149733  4
Travis -0.077131  0.520689  1.741323  0.483508 -0.288359  5

In [208]:
grouped=df.groupby('key1')
grouped['data1'].quantile(0.9)

key1
a    0.951533
b    0.813016
Name: data1, dtype: float64

In [210]:
grouped['data1'].mean()

key1
a    0.622608
b    0.274597
Name: data1, dtype: float64

In [211]:
k1_means=df.groupby('key1').mean().add_prefix('mean_')

In [214]:
pd.merge(df,k1_means,left_on='key1', right_on='key1')

  key1 key2     data1     data2  mean_data1  mean_data2
0    a  one  1.003537  0.926073    0.622608    0.934780
1    a  two  0.120770  1.797579    0.622608    0.934780
2    a  one  0.743518  0.080687    0.622608    0.934780
3    b  one  0.947621 -0.490029    0.274597   -0.050957
4    b  two -0.398427  0.388116    0.274597   -0.050957

In [220]:
df.groupby(['key1','key2']).count()

           data1  data2
key1 key2
a    one       2      2
     two       1      1
b    one       1      1
     two       1      1

In [221]:
df.groupby(['key1','key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [213]:
k1_means

      mean_data1  mean_data2
key1
a       0.622608    0.934780
b       0.274597   -0.050957

In [215]:
key=['one','two','one','two','one']

In [216]:
people.groupby(key).mean()

            a         b         c         d         e  f
one -0.197969  0.934208  0.502588 -0.167092  1.219565  3
two  0.004721 -0.848671 -0.553252  0.408376 -0.539936  3

In [217]:
people

               a         b         c         d         e  f
Joe    -0.449662  1.347727 -0.736147 -1.008046  1.711499  1
Steve  -1.433323 -1.379453 -0.766969 -0.091294 -1.229605  2
Wes    -0.067114       NaN       NaN  0.023262  2.235556  3
Jim     1.442764 -0.317889 -0.339535  0.908046  0.149733  4
Travis -0.077131  0.520689  1.741323  0.483508 -0.288359  5

In [218]:
people.groupby(key).transform(np.mean)

               a         b         c         d         e  f
Joe    -0.197969  0.934208  0.502588 -0.167092  1.219565  3
Steve   0.004721 -0.848671 -0.553252  0.408376 -0.539936  3
Wes    -0.197969  0.934208  0.502588 -0.167092  1.219565  3
Jim     0.004721 -0.848671 -0.553252  0.408376 -0.539936  3
Travis -0.197969  0.934208  0.502588 -0.167092  1.219565  3

In [223]:
def demean(arr):
    return arr - arr.mean()

demeaned = people.groupby(key).transform(demean)

In [224]:
demeaned.groupby(key).mean()

                a             b             c             d             e    f
one -1.387779e-17  5.551115e-17  0.000000e+00 -3.700743e-17  7.401487e-17  0.0
two  0.000000e+00  0.000000e+00  2.775558e-17  2.775558e-17  0.000000e+00  0.0

In [225]:
people.groupby(key).mean()

            a         b         c         d         e  f
one -0.197969  0.934208  0.502588 -0.167092  1.219565  3
two  0.004721 -0.848671 -0.553252  0.408376 -0.539936  3

In [226]:
obj=Series(np.arange(4.),index=['a','b','c','d'])

In [227]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [230]:
obj[1:3]

b    1.0
c    2.0
dtype: float64

In [231]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [232]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [236]:
obj=Series([4, np.nan, 7, np.nan,-3,2])
np.order(obj)

AttributeError: module 'numpy' has no attribute 'order'

In [237]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [238]:
df=DataFrame([[1.4,np.nan],[7.1,-4.5],[np.nan,np.nan],[0.75,-1.3]],index=['a','b','c','d'],columns=['one','two'])

In [239]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [242]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [108]:
data

    k1  k2  v11
0  one   1    0
1  one   1    1
2    2   1    1
3  two   3    3
4  two   3    4
5  two   4    5
6  two   4    6

In [104]:
data

    k1  k2  v11
0  one   1    0
1  one   1    1
2    1   1    1
3  two   3    3
4  two   3    4
5  two   4    5
6  two   4    6

In [92]:
data.drop_duplicates(['k1'])

    k1  k2  v11
0  one   1    0
3  two   3    3

In [100]:
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v11
1  one   1    1
2  one   2    2
4  two   3    4
6  two   4    6

In [113]:
data=DataFrame({'food':['bacon','pulled pork','bacon','Postrami','corned beef','Bacon','pastrami','honey ham','nova lox'],'ounces':[4,3,12,6,7.5,8,3,5,6]})

In [114]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Postrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [ ]:
meat_to_animal={'bacon':'pig','pulled pork':'pig','pastrami':'cow','corned beef':'cow','honey ham':'pig','nova lox’:’salmon’}